Revit 2024 API
PerformanceAdviser.GetElementFilterFromRule Method (Int32, Document)
 Retrieves a filter to restrict elements to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementFilter GetElementFilterFromRule(
	int index,
	Document document
)
Visual Basic
Public Function GetElementFilterFromRule ( _
	index As Integer, _
	document As Document _
) As ElementFilter
Visual C++
public:
ElementFilter^ GetElementFilterFromRule(
	int index,
	Document^ document
)
Parameters
index
Type: System.Int32
 The rule index to get information for.
document
Type: Autodesk.Revit.DB.Document
 Document for which performance problems are being checked.
Return Value
 The filter to restrict elements to be checked.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PerformanceAdviser Class
GetElementFilterFromRule Overload
Autodesk.Revit.DB Namespace